[
  {
    "id": 1,
    "titleAr": "إطلاق المرحلة الثانية من البرامج التطويرية",
    "titleEn": "Launch of Second Phase of Development Programs",
    "summaryAr": "يسعد المعهد الإعلان عن بدء التسجيل في المرحلة الثانية من البرامج التطويرية للمعلمين، والتي تتضمن برامج متقدمة في التكنولوجيا التعليمية",
    "summaryEn": "The institute is pleased to announce the start of registration for the second phase of teacher development programs, which includes advanced programs in educational technology",
    "contentAr": "أطلق المعهد الوطني للتطوير المهني التعليمي اليوم المرحلة الثانية من برامجه التطويرية المتقدمة، والتي تستهدف تطوير قدرات المعلمين والقيادات التعليمية في مجالات التكنولوجيا الحديثة والابتكار في التعليم. تتضمن هذه المرحلة 15 برنامجاً تدريبياً متخصصاً في الذكاء الاصطناعي، الواقع المعزز، وتحليل البيانات التعليمية.",
    "contentEn": "The National Institute for Professional Educational Development today launched the second phase of its advanced development programs, targeting the development of teachers and educational leaders capabilities in modern technology and innovation in education. This phase includes 15 specialized training programs in artificial intelligence, augmented reality, and educational data analytics.",
    "category": "programs",
    "authorAr": "إدارة الإعلام",
    "authorEn": "Media Department",
    "dateAr": "15 يناير 2024",
    "dateEn": "January 15, 2024",
    "image": "https://images.pexels.com/photos/5212345/pexels-photo-5212345.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": true
  },
  {
    "id": 2,
    "titleAr": "شراكة استراتيجية مع جامعة سنغافورة الوطنية",
    "titleEn": "Strategic Partnership with National University of Singapore",
    "summaryAr": "وقع المعهد اتفاقية شراكة مع جامعة سنغافورة الوطنية لتطوير برامج القيادة التعليمية وتبادل الخبرات في مجال التطوير المهني",
    "summaryEn": "The institute signed a partnership agreement with the National University of Singapore to develop educational leadership programs and exchange expertise in professional development",
    "contentAr": "في خطوة مهمة نحو التطوير والتميز، وقع المعهد الوطني للتطوير المهني التعليمي اتفاقية شراكة استراتيجية مع جامعة سنغافورة الوطنية، إحدى الجامعات الرائدة عالمياً في مجال التعليم والبحث العلمي. تهدف هذه الشراكة إلى تطوير برامج القيادة التعليمية وتبادل أفضل الممارسات في مجال التطوير المهني للمعلمين.",
    "contentEn": "In an important step towards development and excellence, the National Institute for Professional Educational Development signed a strategic partnership agreement with the National University of Singapore, one of the world's leading universities in education and scientific research. This partnership aims to develop educational leadership programs and exchange best practices in professional development for teachers.",
    "category": "partnerships",
    "authorAr": "قسم الشراكات الدولية",
    "authorEn": "International Partnerships Department",
    "dateAr": "10 يناير 2024",
    "dateEn": "January 10, 2024",
    "image": "https://images.pexels.com/photos/5212700/pexels-photo-5212700.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": true
  },
  {
    "id": 3,
    "titleAr": "مؤتمر التطوير المهني للمعلمين 2024",
    "titleEn": "Teachers Professional Development Conference 2024",
    "summaryAr": "ينظم المعهد مؤتمره السنوي للتطوير المهني في مارس 2024 بمشاركة خبراء دوليين ومتخصصين في التعليم",
    "summaryEn": "The institute organizes its annual professional development conference in March 2024 with participation of international experts and education specialists",
    "contentAr": "يستعد المعهد الوطني للتطوير المهني التعليمي لتنظيم مؤتمره السنوي الثالث للتطوير المهني للمعلمين، والذي سيعقد في الرياض خلال شهر مارس 2024. يشارك في المؤتمر أكثر من 500 مشارك من المعلمين والقيادات التعليمية، بالإضافة إلى خبراء دوليين من أكثر من 15 دولة.",
    "contentEn": "The National Institute for Professional Educational Development is preparing to organize its third annual professional development conference for teachers, which will be held in Riyadh during March 2024. More than 500 participants including teachers and educational leaders will participate in the conference, along with international experts from more than 15 countries.",
    "category": "events",
    "authorAr": "لجنة تنظيم المؤتمرات",
    "authorEn": "Conference Organization Committee",
    "dateAr": "5 يناير 2024",
    "dateEn": "January 5, 2024",
    "image": "https://images.pexels.com/photos/1181534/pexels-photo-1181534.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": false
  },
  {
    "id": 4,
    "titleAr": "تخرج الدفعة الأولى من برنامج القيادة التعليمية",
    "titleEn": "First Batch Graduates from Educational Leadership Program",
    "summaryAr": "احتفل المعهد بتخرج 150 قائد تعليمي من الدفعة الأولى لبرنامج القيادة التعليمية المتقدم",
    "summaryEn": "The institute celebrated the graduation of 150 educational leaders from the first batch of the advanced educational leadership program",
    "contentAr": "احتفل المعهد الوطني للتطوير المهني التعليمي بتخرج الدفعة الأولى من برنامج القيادة التعليمية المتقدم، والتي ضمت 150 قائد تعليمي من مختلف المناطق في المملكة. البرنامج الذي استمر لمدة 8 أشهر ركز على تطوير مهارات القيادة الحديثة وإدارة التغيير في المؤسسات التعليمية.",
    "contentEn": "The National Institute for Professional Educational Development celebrated the graduation of the first batch from the advanced educational leadership program, which included 150 educational leaders from various regions in the Kingdom. The program, which lasted 8 months, focused on developing modern leadership skills and change management in educational institutions.",
    "category": "achievements",
    "authorAr": "قسم البرامج التدريبية",
    "authorEn": "Training Programs Department",
    "dateAr": "28 ديسمبر 2023",
    "dateEn": "December 28, 2023",
    "image": "https://images.pexels.com/photos/5428010/pexels-photo-5428010.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": false
  },
  {
    "id": 5,
    "titleAr": "إطلاق منصة التعلم الإلكتروني الجديدة",
    "titleEn": "Launch of New E-Learning Platform",
    "summaryAr": "أطلق المعهد منصة تعليمية رقمية متطورة تتيح للمتدربين الوصول للمحتوى التدريبي بسهولة ومرونة",
    "summaryEn": "The institute launched an advanced digital educational platform that allows trainees to access training content easily and flexibly",
    "contentAr": "كشف المعهد الوطني للتطوير المهني التعليمي عن إطلاق منصته التعليمية الرقمية الجديدة \"تطوير بلس\"، والتي توفر تجربة تعلم متكاملة وتفاعلية للمتدربين. تضم المنصة أكثر من 200 ساعة تدريبية في مختلف التخصصات التعليمية، مع أدوات تقييم ذكية ونظام متابعة متقدم.",
    "contentEn": "The National Institute for Professional Educational Development unveiled the launch of its new digital educational platform \"Tatweer Plus\", which provides an integrated and interactive learning experience for trainees. The platform includes more than 200 training hours in various educational specializations, with smart assessment tools and an advanced tracking system.",
    "category": "programs",
    "authorAr": "فريق التطوير التقني",
    "authorEn": "Technical Development Team",
    "dateAr": "20 ديسمبر 2023",
    "dateEn": "December 20, 2023",
    "image": "https://images.pexels.com/photos/5427648/pexels-photo-5427648.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": false
  },
  {
    "id": 6,
    "titleAr": "ورشة عمل حول الذكاء الاصطناعي في التعليم",
    "titleEn": "Workshop on Artificial Intelligence in Education",
    "summaryAr": "ينظم المعهد ورشة عمل متخصصة حول تطبيقات الذكاء الاصطناعي في التعليم بمشاركة خبراء من وادي السيليكون",
    "summaryEn": "The institute organizes a specialized workshop on AI applications in education with experts from Silicon Valley",
    "contentAr": "يستضيف المعهد الوطني للتطوير المهني التعليمي ورشة عمل متخصصة حول \"تطبيقات الذكاء الاصطناعي في التعليم\" بمشاركة نخبة من الخبراء الدوليين من وادي السيليكون وجامعات عالمية رائدة. الورشة التي ستعقد لمدة ثلاثة أيام ستركز على كيفية دمج تقنيات الذكاء الاصطناعي في العملية التعليمية.",
    "contentEn": "The National Institute for Professional Educational Development hosts a specialized workshop on \"Applications of Artificial Intelligence in Education\" with participation of elite international experts from Silicon Valley and leading global universities. The three-day workshop will focus on how to integrate AI technologies into the educational process.",
    "category": "events",
    "authorAr": "قسم الفعاليات العلمية",
    "authorEn": "Scientific Events Department",
    "dateAr": "15 ديسمبر 2023",
    "dateEn": "December 15, 2023",
    "image": "https://images.pexels.com/photos/8500434/pexels-photo-8500434.jpeg?auto=compress&cs=tinysrgb&w=800",
    "featured": false
  }
]